import lang from "../lang";

export default {
  name: "Ukrainian (Ukraine)",

  messages: {
    setupCompleted: "Сервер налаштовано. Категорія ModMail була створена.",
    messageSoon: "Незабаром Ви отримаєте повідомлення.",
  },

  commands: {
    unsubscribe: {
      success: "Ви успішно відписались від цієї теми.",
      notSubscribed: "Ви не підписані на цю тему.",
      error: "Сталась помилка при спробі відписати вас від цієї теми.",
    },
    title: {
      success: "Заголовок було успішно оновлено.",
      error: "Заголовок не може бути оновлено.",
      noTitle: "Надайте заголовок або напишіть `removetitle`, щоб вилучити.",
    },
    subscribe: {
      success: "Ви будете отримувати сповіщення про оновлення в цій темі.",
      alreadySubscribed: "Ви вже отримуєте сповіщення по цій темі.",
      error: "Сталась помилка при спробі відписати вас від цієї теми.",
    },
    snippet: {
      invalidName: "Ви повинні вказати назву сніпету",
      invalidText: "Ви повинні вказати текст сніпету.",
      takenName: "Сніпет з такою назву вже існує.",
      success: "Сніпет `%s` був успішно створений.",
      error: "Сталась помилка при спробі створити сніпет.",
      unknownSnippet: "Не вдалось знайти сніпет з такою назвою.",
      updated: "Сніпет `%s` був успішно оновлений.",
      deleted: "Сніпет `%s` був успішно видалений.",
      cantDelete: "Не вдалось видалити сніпет `%s`.",
      empty: "На цьому сервері немає сніпетів.",
      list: "НАЗВА | ВМІСТ",
      help: "Виберіть `create`, `edit`, `delete` або `list`.",
    },
    reply: {
      noReply: "Ви повинні надати повідомлення для відповіді.",
    },
    rename: {
      noName: "Ви повинні надати нову назву для цієї теми.",
      success: "Нова назва цієї теми: `%s`.",
      error: "Сталась помилка при спробі змінити назву теми.",
    },
    ping: "Мій пінг: `%sms`.",
    nsfw: {
      enabled: "Цю тему помічено як NSFW.",
      disabled: "Цю тему більше не помічено як NSFW.",
      enableError: "Сталась помилка при спробі помітити цю тему як NSFW.",
      disableError: "Сталась помилка при спробі зняти мітку NSFW з цієї теми.",
    },
    note: {
      noNote: "Надайте примітку або напишіть `removenote`, щоб її вилучити.",
      success: "Примітка була вилучена.",
      error: "Примітка не може бути змінена.",
    },
    move: {
      noCategory: "Ви повинні надати назву для цієї категорії.",
      notFound: "Не вдалось знайти категорію з цією назвою.",
      alreadyInCategory: "Ця тема вже знаходиться в цій категорії.",
      noPermission:
        "У мене відсутні права, щоб перемістити цю тему в категорію.",
      success: "Цю тему переміщено до `%s`.",
      error: "Сталась помилка при спробі перемістити цю тему.",
    },
    help: {
      title: "ModMail створено ThePhoDit",
      description:
        "ModMail це Discord бот який дозволяє Вам комунікувати з Вашими учасниками через Особисті повідомлення.\nЯкщо Ви бажаєте перевірити команди бота, прочитайте нашу документацію за посиланням https://modmail.phodit.xyz",
    },
    edit: {
      noMessage: "Ви повинні надати ID повідомлення.",
      noContent: "Ви повинні надати новий текст повідомлення.",
      notFound: "Не вдалось знайти повідомлення з вказаним ID.",
      success: "Повідомлення було успішно відредаговано.",
      error: "Сталась помилка при спробі відредагувати повідомлення.",
    },
    delete: {
      noMessage: "Ви повинні надати ID повідомлення.",
      notFound: "Не вдалось знайти повідомлення з вказаним ID.",
      success: "Повідомлення було успішно видалено.",
      error: "Сталась помилка при спробі видалити повідомлення.",
    },
    contact: {
      noUser: "Ви повинні @згадати учасника або надати його ID",
      notFound: "Не вдалось знайти учасника з таким ID.",
      isBot: "Заборонено писати ботам.",
      channelError: "Сталась помилка при спробі створити канал.",
      DMError: "Сталась помилка при спробі відправити повідомлення",
      alreadyContacted: "У вас вже є відкрита тема з цим учасником.",
      success: "Тема була успішно створена.",
      message:
        "Привіт %s, це тема ModMail створена %m. Ви можете відповісти на це повідомлення, щоб надіслати повідомлення для адміністрації сервера.",
      error: "Сталась помилка при спробі створити тему.",
    },
    close: {
      invalidTime:
        "Ви повинні вказати дійсне значення часу (Між 10 хвилинами та 3 днями).",
      closerError: "Сталася помилка під час планування закриття теми.",
      closerUpdateError:
        "Сталася помилка під час оновлення планування закриття теми.",
      title: "Закриття заплановано",
      description: "Цю тему буде закрито `%s` якщо не буде нових повідомлень.",
    },
    category: {
      noCategory: "Ви повинні надати назву категорії.",
      exists: "Категорія з такою назвою вже існує.",
      notFoundID: "Не вдалось знайти категорію з таким ID.",
      notFoundName: "Не вдалось знайти категорію з такою назвою.",
      created: "Категорію було успішно створено.",
      createdError: "Сталась помилка при спробі створити категорію",
      deleted: "Категорію було успішно видалено.",
      deletedError: "Сталась помилка при спробі видалити категорію.",
      empty: "Не вдалось знайти категорій на цьому сервері.",
      list: "НАЗВА | КАТЕГОРІЯ",
      help: "Виберіть `create`, `delete` або `list`.",
    },
    blacklist: {
      noOption: "Ви повинні надати опцію (`add` або `remove`)",
      noUser: "Ви повинні @згадати учасника або надати його ID",
      notFound: "Не вдалось знайти учасника з таким ID.",
      alreadyBlacklisted: "Цей учасник вже заблокований.",
      notBlacklisted: "Цей учасник не заблокований.",
      blacklisted: "Цього учасника було успішно заблоковано.",
      unblacklisted: "Цього учасника було успішно розблоковано.",
      error: "Сталась помилка при спробі оновити список заблокованих.",
    },
    alias: {
      noOption: "Ви повинні надати опцію (`add` або `remove`)",
      noName: "Ви повинні надати назву скорочення.",
      reservedAlias: "Це скорочення вже використовується.",
      noCommand: "Ви повинні надати назву команди щоб створити її скорочення.",
      invalidCommand: "Такої команди не існує.",
      alreadyExists: "Скорочення з такою назвою вже існує.",
      created: "Скорочення було успішно створено.",
      createdError: "Сталась помилка при спробі створити скорочення.",
      unknownAlias: "Не вдалось знайти скорочення з такою назвою.",
      deleted: "Скорочення було успішно вилучено.",
      deletedError: "Сталась помилка при спробі вилучити скорочення.",
    },
    permission: {
      noLevel:
        "Будь ласка, виберіть рівень або назву команди:\nРівні **regular**, **support** та **admin**.\nВикористання: %ppermission {levelName/commandName} {add/remove} {ID учасника або ID ролі}",
      noOption: "Ви повинні надати опцію (`add` або `remove`)",
      noID: "Ви повинні надати ID ролі або учасника.",
      alreadyExists: "Ця роль або користувач вже має ці права.",
      notExists: "Ця роль або учасник не має цих прав.",
      added: "Право було успішно оновлено.",
      addedError: "Сталась помилка при спробі оновити права.",
      removed: "Право було успішно вилучено.",
      removedError: "Сталась помилка при спробі вилучити права.",
      unknownCommand: "Не вдалось знайти команду з такою назвою.",
    },
    set: {
      title: "Налаштування які можна змінити.",
      description: `
      \`avatar\`: надайте зображення, щоб змінити аватар бота.
      \`username\`: змінити користувацьке ім'я бота (не серверний нікнейм).
      \`prefix\`: змінити префікс команд (макс. довжина: 4).
      \`category\`: надайте ID категорії де Ви бажаєте, щоб створювались нові теми.
      \`logs\`: надайте ID каналу де Ви бажаєте, щоб відправлялись повідомлення логів.
      \`status\`: змінити статус бота.
      \`status_type\`: змінити тип статусу бота.
      \`notification\`: надайте ID ролі яка буде згадуватись при створенні нової теми.
      \`account_age\`: час від моменту створення акаунту, необхідний для створення нової теми.
      \`guild_age\`: час від моменту приєднання до сервера, необхідний для створення нової теми.
      \`guild_age_id\`: ID серверу на якому потрібно мати вказаний **guild_age**.
      \`exclude_internal_logs\`: stops logging all internal messages. It can either be true or false.
      \`exclude_internal_logs\`: зупиняє записування усіх внутріщніх журналів. Може бути true або false.
      \`embed_creation_title\`: заголовок ембеду, який буде відправлено учаснику коли нова тема створена.
      \`embed_creation_thumbnail\`: додаткове зображення ембеду, який буде відправлено учаснику коли нова тема створена ("none" щоб вимкнути).
      \`embed_creation_description\`: опис ембеду, який буде відправлено учаснику коли нова тема створена.
      \`embed_creation_color\`: колір (hex код) ембеду, який буде відправлено учаснику коли нова тема створена.
      \`embed_creation_footer_text\`: нижній підпис ембеду, який буде відправлено учаснику коли нова тема створена.
      \`embed_creation_footer_image\`: зображення нижню підписку ембеду який буде відправлено учаснику коли нова тема створена.
      \`embed_contact_title\`: заголовок ембеду який буде відправлено учаснику коли нова тема створена адміністратором.
      \`embed_contact_thumbnail\`: додаткове зображення ембеду який буде відправлено учаснику коли нова тема створена адміністратором ("none" щоб вимкнути).
      \`embed_contact_description\`: опис ембеду який буде відправлено учаснику коли нова тема створена адміністратором.
      \`embed_contact_color\`: колір (hex код) ембеду який буде відправлено учаснику коли нова тема створена адміністратором.
      \`embed_contact_footer_text\`: нижній підпис ембеду який буде відправлено учаснику коли нова тема створена адміністратором.
      \`embed_contact_footer_image\`: зображення нижнього підпису ембеду який буде відправлено учаснику коли нова тема створена адміністратором.
      \`embed_reply_color\`: колір (hex код) ембеду який буде відправлено коли адміністратор відповідає учаснику.
      \`embed_userReply_color\`: колір (hex код) ембеду який буде відправлено учаснику коли адміністратор відповідає на повідомлення.
      \`embed_userReply_footer_text\`: нижній підпис ембеду який буде відправлено учаснику коли адміністратор відповідає на повідомлення (\`$role$\` буде замінятись найвищою роллю адміністратора).
      \`embed_userReply_footer_image\`: зображення нижнього підпису ембеду який буде відправлено учаснику коли адміністратор відповідає на повідомлення.
      \`embed_closure_title\`: заголовок ембеду який буде відправлено учаснику коли тема закрита.
      \`embed_closure_thumbnail\`: додаткове зображення ембеду який буде відправлено учаснику коли тема закрита ("none" щоб вимкнути).
      \`embed_closure_description\`: опис ембеду який буде відправлено учаснику коли тема закрита.
      \`embed_closure_color\`: колір (hex код) ембеду який буде відправлено учаснику коли тема закрита.
      \`embed_closure_footer_text\`: нижній підпис ембеду який буде відправлено учаснику коли тема закрита.
      \`embed_closure_footer_image\`: зображення нижнього підпису ембеду який буде відправлено учаснику коли тема закрита.
      \`embed_staff_title\`: заголовок ембеду який буде відправлено адміністраторам коли нова тема створена.
      \`embed_staff_color\`: колір (hex код) ембеду який буде відправлено адміністраторам коли нова тема створена.`,
      usage: {
        title: "Використання",
        description: "%pset {setting} {value}",
      },
      noValue: "Ви повинні надати значення.",
      noImage: "Ви повинні прикріпити зображення.",
      avatar: {
        error: "Виникла помилка при спробі змінити аватар бота.",
        success: "Аватар бота успішно змінено.",
      },
      unknownError: "Виникла помилка при спробі змінити налаштування бота.",
      usernameSuccess: "Ім'я користувача бота було успішно змінений.",
      prefix: {
        success: "Префікс бота був успішно змінений.",
        error: "Довжина префіксу бота повинна бути між 1 на 4",
        unknownError: "Виникла помилка при спробі змінити префікс бота.",
      },
      category: {
        success: "Категорія бота була успішно змінена.",
        error: "Категорія бота повинна бути дійсним значенням ID.",
        unknownError: "Виникла помилка при спробі змінити категорію бота.",
      },
      logs: {
        success: "Канал логів бота був успішно змінений.",
        error: "Канал логів бота повинен бути дійсним значенням ID.",
        unknownError: "Виникла помилка при спробі змінити канал логів бота.",
      },
      status: {
        success: "Статус бота був успішно змінений.",
        unknownError: "Виникла помилка при спробі змінити статус бота.",
      },
      statusType: {
        success: "Тип статусу бота був успішно змінений.",
        unknownError: "Виникла помилка при спробі змінити тип статусу бота.",
        invalidTwitch:
          "Вказаний URL повинен бути дійсним значенням Twitch або YouTube URL.",
        help: "Тип статусу може бути тільки одним з: `playing`, `streaming`, `listening`, `watching`.",
      },
      accountAge: {
        invalidFormat:
          "Ви обрали невірний формат. Наприклад, 1d = 1 день / 30m = 30 хвилин. Щоб вимкнути, вкажіть `0`.\nДійсні букви: m / h / d / w / y",
        success: "Вікове обмеження облікового запису був успішно змінений.",
        unknownError:
          "Виникла помилка при спробі оновити вікове обмеження облікового запису",
      },
      guildAge: {
        invalidGuild:
          "Мене немає на цьому сервері, будь ласка, оберіть той, на якому я є.",
        success: "ID серверу для guild_age успішно змінено.",
        unknownError: "Сталась помилка при спробі змінити guild_age ID",
      },
      notification: {
        success: "Роль сповіщень успішно оновлено.",
        unknownError: "Сталась помилка при спробі змінити роль сповіщень.",
      },
      excludeInternalLogs: {
        isExcluded: "Внутрішні журнали тепер будуть виключені",
        isIncluded: "Внутрішні журнали тепер будуть включені",
        unknownError:
          "Сталась помилка при спробі змінити канал для виключення внутрішніх журналів.",
      },
      embedCreation: {
        success: (iin) => `Створення ембеду ${iin} успішно оновлено.`,
        unknownError: (iin) =>
          `Сталась помилка при спробі змінити створення ембеду ${iin}.`,
      },
      embedContact: {
        success: (iin) =>
          `The embed contact ${iin} has been updated successesfuly.`,
        unknownError: (iin) =>
          `here was an error changing the embed closure the embed contact ${iin}.`,
      },
      embedReply: {
        success: (iin) => `Відповідь ембеду ${iin} було успішно оновлено.`,
        unknownError: (iin) =>
          `Сталась помилка при спробі змінити відповідь ембеду ${iin}.`,
      },
      embedUserReply: {
        success: (iin) =>
          `Ембед відповіді користувача ${iin} успішно оновлено.`,
        unknownError: (iin) =>
          `Сталась помилка при спробі змінити ембед відповіді користувача ${iin}.`,
      },
      embedClosure: {
        success: (iin) => `Ембед закриття ${iin} успішно оновлено.`,
        unknownError: (iin) =>
          `Сталась помилка при спробі змінити the ембед закриття ${iin}.`,
      },
      embedStaff: {
        success: (iin) => `Ембед адміністратора ${iin} успішно оновлено.`,
        unknownError: (iin) =>
          `Сталась помилка при спробі змінити ембед адміністратора ${iin}.`,
      },
    },
  },

  embeds: {
    noContent: "Вміст не вказано.",
    files: "Файли",
    containsFiles: "Це повідомлення містить %n файлів%s",
    closureCancelled: {
      title: "Закриття скасовано.",
      description: "Цей тікет більше не буде закрито через неактивність.",
    },
    threadClosed: {
      title: "Тему закрито",
      description: "Тема з `%u` була закрита %s",
    },
    staffReply: "Відповідь адміністрації",
    user: "Учасник",
    pastThreads: "Минулі теми",
  },

  errors: {
    categoryCreate: "Не вдалося створити категорію. Налаштування скасовано.",
    configAdd:
      "Не вдалося додати конфігурацію до бази даних. Налаштування скасовано.",
    accountAge:
      "Ваш обліковий запис не був створений достатньо давно, щоб зв’язатися з адміністрацією.",
    serverAge:
      "Ваш обліковий запис не був на сервері достатньо довго, щоб зв’язатися з адміністрацією.",
    unknown: "Сталася невідома помилка. Будь ласка, спробуйте пізніше.",
    contactStaff: "Не вдалося надіслати ваше повідомлення адміністрації.",
    invalidPermissions:
      "Ви не маєте необхідних прав для використання цієї команди.",
    snippet: "Під час спроби отримати сніпет сталася помилка.",
    noLogsUrl: "У вас не налаштовано URL-адресу журналів.",
    noUserIDProvided: "Ви повинні надати дійсний ID учасника.",
    noLogsFound: "Мені не вдалося знайти журнали для цього учасника.",
    invalidHexColor: "Необхідно вказати дійсний hex-колір.",
    invalidLink: "Ви повинні надати дійсне посилання.",
  },
} as lang;
